Repository: godiard/typing-turtle-activity
Catalog: po/*.po
Languages: de, ru

source: Typing Turtle
ru: Печатающая Черепашка

source: Need some help typing? Here you will learn the best way to hold your hands in order for you to become a faster typist!
de: Brauchst du Hilfe beim Tippen? Hier lernst du die beste Handhaltung, um ein schnellerer Tastenschreiber zu werden!
ru: Нужна помощь в печатании на клавиатуре? Здесь лучшее место, чтобы научиться печать быстрее!

source: Go Back
de: Geh zurück
ru: Вернуться назад

source: You finished!
de: Du hast es geschafft!
ru: Ты закончил!

source: Your score was %(score)d.
de: Deine Punktzahl war %(score)d.
ru: Счёт был %(score)d.

source: You earned a %(type)s medal!
de: Du erhälst eine %(type)s-Medalie!
ru: Ты получил %(type)s медаль!

source: Press the ENTER key to continue.
de: Drücke ENTER um fortzufahren.
ru: Для продолжения нажми клавишу ENTER.

source: SCORE: %d
de: PUNKTZAHL: %d
ru: СЧЁТ: %d

source: Type the words to pop the balloons!
de: Schreibe die Wörter, um die Ballons zum Platzen zu bringen!
ru: Вводи слова, чтобы лопать шарики!

source: Edit Lessons
de: Bearbeite die Lektionen
ru: Редактировать Уроки

source: Name
ru: Имя

source: Description
de: Beschreibung
ru: Описание

source: Type
de: Art
ru: Тип

source: Import Lessons from Journal
de: Importiere Lektionen aus Tagebuch
ru: Загрузить уроки из Журнала

source: Export Lessons to Journal
de: Exporiere Lektionen aus Tagebuch
ru: Выгрузить Уроки в Журнал

source: Save Lessons to Activity
de: Speichere Lektionen zur Aktivität
ru: Сохранить Уроки в Приложении

source: Text
ru: Текст

source: Balloon Game
de: Ballonspiel
ru: Игра Воздушные шарики

source: Delete Lesson?
de: Lektion löschen?
ru: Удалить Урок?

source: Deleting the lesson will erase the lesson content.
de: Das Löschen der Lektion löscht die Unterrichtsinhalte.
ru: Удаление урока сотрёт всё содержимое урока.

source: (Exported Lessons)
de: (Exportierte Lektionen)
ru: (Выгруженные Уроки)

source: Edit a Lesson
de: Bearbeite eine Lektion
ru: Редактировать Урок

source: New keys
de: Neue Tasten
ru: Новые клавиши

source: Known keys
de: Bekannte Tasten
ru: Знакомые клавиши

source: Length
de: Dauer
ru: Длина

source: Generate!
de: Erfinde!
ru: Сгенерировать!

source: Edit Word List
de: Bearbeite die Wörterliste
ru: Редактировать Список Слов

source: Step #%d
de: Schritt #%d
ru: Шаг #%d

source: Keys
de: Tasten
ru: Клавиши

source: Words
de: Worte
ru: Слова

source: Instructions
de: Anleitung
ru: Инструкции

source: Accuracy
de: Richtigkeit
ru: Точность

source: WPM
de: WPN
ru: Слов/мин

source: Score
de: Ergebnis
ru: Счёт

source: Lesson Details
de: Details der Lektion
ru: Детали Урока

source: Normal Lesson
de: Normale Lektion
ru: Обычный Урок

source: Options
de: Einstellungen
ru: Настройки

source: Allow Mistakes
de: Fehler erlauben
ru: Разрешить Ошибки

source: Allow Backspace
de: Zurücksetzten erlauben
ru: Разрешить Backspace

source: Automatic Lesson Generator
de: Automatischer Lektionengenerator
ru: Генератор Урока

source: Medal Requirements
de: Bedingung für eine Medallie
ru: Требования для Медали

source: Bronze
ru: Бронза

source: Silver
de: Silber
ru: Серебро

source: Gold
ru: Золото

source: Type or paste words here, for the Automatic Lesson Generator. If empty, the dictionary will be used.
de: Geben oder fügen Sie hier Wörter für den automatischen Lektionsenerator ein. Wenn leer, wird das Wörterbuch benutzt.
ru: Напечатай или вставь слова здесь, для Генерации Урока. Иначе будет использоваться словарь.

source: Well done!
de: Gut gemacht!
ru: Отлично сделано!

source: Good job.
de: Gute Arbeit.
ru: Хорошая работа.

source: Awesome!
de: Fantastisch!
ru: Потрясающе!

source: Way to go!
de: Weiter so!
ru: Пора в путь!

source: Wonderful!
de: Wundervoll!
ru: Превосходно!

source: Nice work.
de: Schöne Arbeit.
ru: Прекрасная работа.

source: You did it!
de: Du hast es geschafft!
ru: Ты сделал это!

source: Be careful to use the correct finger to press each key. Look at the keyboard below if you need help remembering.
de: Achte darauf, das du den richtigen Finger für jede Taste verwendest. Schau unten auf die Tastatur, wenn du dich nicht erinnern kannst.
ru: Будь осторожен, используй правильный палец для нажатия каждой клавиши. Смотри на клавиатуру ниже, если не сможешь вспомнить.

source: Try to type at the same speed, all the time. As you get more comfortable you can increase the speed a little.
de: Versuche die Tippgeschwindigkeit die ganze Zeit über beizubehalten. Wenn es einfacher wird, kannst du die Geschwindikeit langsam erhöhen.
ru: Старайся печатать с одинаковой скоростью все время. Как только станет комфортно, ты можешь немного увеличить скорость.

source: left little
de: Linker kleiner Finger
ru: левый мизинец

source: left ring
de: Linker Ringfinger
ru: левый безымянный

source: left middle
de: Linker Mittelfinger
ru: левый средний

source: left index
de: Linker Zeigefinger
ru: левый указательный

source: left thumb
de: Linker Daumen
ru: левый большой

source: right little
de: Rechter kleiner Finger
ru: правый мизинец

source: right ring
de: Rechter Ringfinger
ru: правый безымянный

source: right middle
de: Rechter Mittelfinger
ru: правый средний

source: right index
de: Rechter Zeigefinger
ru: правый указательный

source: right thumb
de: Rechter Daumen
ru: правый большой

source: and %s keys
de: und %s Tasten
ru: и %s клавиши

source: key
de: Taste
ru: клавиша

source: In this lesson, you will learn the %(keynames)s. Press the ENTER key when you are ready to begin!
de: In dieser Übungseinheit wirst du die %(keynames)s erlernen. Drücke ENTER wenn du bereit bist, anzufangen!
ru: В этом уроке ты выучишь %(keynames)s. Нажми клавишу ENTER, когда будешь готов начать!

source: Let's learn the new keys.
de: Lass uns die neuen Tasten lernen!
ru: Давай учить новые клавиши.

source: Practice typing the keys you just learned.
de: Übe das Tippen der Tasten welche du gerade gelernt hast.
ru: Практикуй нажатие клавиш, которые ты только что выучил.

source: Now put the keys together into pairs.
de: Jetzt setze die Tasten in Paaren zusammen.
ru: Теперь нажми на обе клавиши вместе.

source: Time to type jumbles.
de: Jetzt ist es an der Zeit durcheinander zu Tippen.
ru: Время писать быстро и непонятно.

source: Time to type real words.
de: Jetzt ist es an der Zeit echte Wörter zu tippen.
ru: Время печатать настоящие слова.

source: Hihowahyah! Ready to learn the secret of fast typing?
de: Hihowhayah! Bereit das Geheimnis des schnellen Schreibens zu erlernen?
ru: Hihowahyah! Готов узнать секрет быстрой печати?

source: Always use the correct finger to press each key!
de: Verwende immer den richtigen Finger für jede Taste!
ru: Всегда используйте правильный палец для нажатия каждой клавиши!

source: Now, place your hands on the keyboard just like the picture below.
de: Lege jetzt deine Hand auf die Tastatur, wie auf dem Bild unten gezeigt wird.
ru: Теперь расположи руки над клавиатурой как на картинке ниже.

source: When you're ready, press the SPACE bar with your thumb!
de: Wenn du soweit bist, drücke die Leertaste mit deinem Daumen!
ru: Когда будешь готов, нажми пробел большим пальцем!

source: Good job! The SPACE bar is used to insert spaces between words.
de: Gut gemacht! Die LEERTASTE wird verwendet um Leerzeichen, also Abstände, zwischen den Wörtern einzufügen.
ru: Хорошо! Пробел используется для пространств между словами.

source: Press the SPACE bar again with your thumb.
de: Drücke die LEERTASTE erneut mit deinem Daumen.
ru: Снова нажми пробел большим пальцем.

source: Now I'll teach you the second key, ENTER.
de: Jetzt werde ich dir die Zweite Taste zeigen, ENTER.
ru: Теперь я научу тебя второй клавише, ENTER.

source: That's the big square key near your right little finger.
de: Das ist die große Taste nahe deines rechten kleinen Fingers.
ru: Это большая квадратная клавиша возле твоего правого мизинца.

source: Now, reach your little finger over and press ENTER.
de: Jetzt strecke deinen kleinen Finger danach, und drücke ENTER.
ru: Теперь дотянись мизинцем до ENTER и нажми на нее.

source: Great! When typing, the ENTER key is used to begin a new line.
de: Großartig! Wenn du die ENTER-Taste drückst wird eine neue Zeile angefangen.
ru: Здорово! Когда печатаешь, клавиша ENTER используется для начала новой строки.

source: Press the ENTER key again with your right little finger.
de: Drücke die ENTER-Taste erneut mit deinem rechten kleinen Finger.
ru: Снова нажми клавишу ENTER правым мизинцем.

source: Copy out the following text.
de: Schreibe den folgenden Text ab.
ru: Скопируй следующий текст.

source: left little finger
de: linker keiner Finger
ru: левый мизинец

source: left ring finger
de: linker Ringfinger
ru: левый безымянный палец

source: left middle finger
de: linker Mittelfinger
ru: левый средний палец

source: left index finger
de: linker Zeigefinger
ru: левый указательный палец

source: right little finger
de: rechter kleiner Finger
ru: правый мизинец

source: right ring finger
de: rechter Ringfinger
ru: правый безымянный палец

source: right middle finger
de: rechter Mittelfinger
ru: правый средний палец

source: right index finger
de: rechter Zeigefinger
ru: правый указательный палец

source: <b>WPM:</b> %(wpm)d
ru: <b>Слов/мин:</b> %(wpm)d

source: <b>Accuracy:</b> %(accuracy)d%%
de: <b>Treffgenauigkeit:</b> %(accuracy)d%%
ru: <b>Точность:</b> %(accuracy)d%%

source: Press and hold the shift key with your %(finger)s,
de: Drücke und halte die Shift-Taste mit deinem %(finger)s,
ru: Нажми и удерживай клавишу shift, используя %(finger)s,

source: then press the %(letter)s key with your %(finger)s.
de: Dann drücke die %(letter)s Taste mit deinem %(finger)s.
ru: потом нажми клавишу %(letter)s, используя %(finger)s.

source: Press and hold the altgr key,
de: Drücke und halte die altgr-Taste,
ru: Нажми и удерживай клавишу altgr,

source: Press and hold the altgr and shift keys,
de: Drücke und halte die altgr und die schift-Taste,
ru: Нажми и удерживай клавиши altgr и shift?

source: Press the %(letter)s key with your %(finger)s.
de: Drücke die %(letter)s Taste mit deinem %(finger)s.
ru: Нажми клавишу %(letter)s, используя %(finger)s.

source: Uh oh! Your keyboard cannot type the letter '%s'.
de: Oh! Deine Tastatur kann den Buchstaben '%s' nicht tippen.
ru: О нет! Твоя клавиатура не может напечатать букву '%s'.

source: Please change your keyboard settings and try this lesson again.
de: Bitte ändere deine Tastatur-Einstellungen und versuche diese Lektion noch einmal.
ru: Пожалуйста, измени настройки своей клавиатуры и повтори этот урок заново.

source: Good job!
de: Gut gemacht!
ru: Хорошая работа!

source: Nice work!
de: Gute Arbeit!
ru: Молодец!

source: You finished the lesson in %(time)d seconds, with %(errors)d errors.
de: Du hast die Übungseinheit in %(time)d Sekunden mit %(errors)d Fehlern abgeschlossen.
ru: Ты закончил урок за %(time)d секунд, ошибок - %(errors)d.

source: Your words per minute (WPM) was %(wpm)d, and your accuracy was %(accuracy)d%%.
de: Deine Wörter pro Minute (WPM) waren %(wpm)d, und deine Genauigkeit war %(accuracy)d%%.
ru: Слов в минуту - %(wpm)d, точность - %(accuracy)d%%.

source: You finished the lesson with %(errors)d errors.
de: Du hast die Lektion mit %(errors)d Fehlern abgeschlossen.
ru: Ты закончил урок с количеством ошибок - %(errors)d.

source: Your accuracy was %(accuracy)d%%.
de: Deine Genauigkeit war %(accuracy)d%%.
ru: Твоя точность - %(accuracy)d%%.

source: Congratulations! You earned a %(type)s medal!
de: Gratuliere! Du erhälst eine %(type)s Medallie!
ru: Поздравляем! Ты выиграл медаль %(type)s!

source: You need to practice this lesson more before moving on.
de: Du musst diese Lektion mehr üben, bevor du weitermachst.
ru: Нужно больше практики с этим уроком перед тем, как продолжать.

source: You almost got a medal! Next time, try not to make as many errors.
de: Du hast beinahe eine Medallie bekommen! Das nächste Mal, versuche, nicht so viele Fehler zumachen.
ru: Ты почти получил медаль! В следующий раз, постарайся не делать так много ошибок.

source: You almost got a medal! Next time, try to type a little faster.
de: Du hast beinahe eine Medallie bekommen! Das nächste Mal, versuche ein bisschen schneller zu tippen.
ru: Ты почти получил медаль! В следующий раз, постарайся печатать чуть быстрее.

source: Next
de: Weiter
ru: Дальше

source: Previous
de: Zurück
ru: Ранее

source: Start Lesson
de: Starte die Lektion
ru: Начать Урок

source: You earned a medal in this lesson! Advance to the next one by clicking the Next button.
de: Du hast in dieser Lektion eine Medallie bekommen! Mache mit der nächsten weiter indem du auf den Weiter-Button klickst.
ru: Ты получил медаль за этот урок! Переходи к следующему нажав на кнопку Дальше.

source: No Medal Yet
de: Noch keine Medallie
ru: Пока нет медали

source: Bronze Medal
de: Bronzemedallie
ru: Бронзовая Медаль

source: Silver Medal
de: Silbermedallie
ru: Серебряная Медаль

source: Gold Medal
de: Goldmedallie
ru: Золотая Медаль

source: <span font_desc='Serif Bold Italic 28'>Certificate of Achievement</span>
de: <span font_desc='Serif Bold Italic 28'>Zertifikat der Leistung</span>
ru: <span font_desc='Serif Bold Italic 28'>Сертификат о Достижении</span>

source: <span font_desc='Sans 16'>This certifies that</span>
de: <span font_desc='Sans 16'>Dies bescheinigt, dass</span>
ru: <span font_desc='Sans 16'>Подтверждение того, что</span>

source: <span font_desc='Sans 16'>earned a %(type)s medal in </span>
de: <span font_desc='Sans 16'>erhield eine %(type)s Medallie in </span>
ru: <span font_desc='Sans 16'>получил медаль %(type)s за </span>

source: <span font_desc='Sans 16'>in <b><u><i>%(lesson)s</i></u></b></span>
ru: <span font_desc='Sans 16'> <b><u><i>%(lesson)s</i></u></b></span>

source: <span font_desc='Sans 16'>on <b><u><i>%(date)s</i></u></b>.</span>
de: <span font_desc='Sans 16'>am <b><u><i>%(date)s</i></u></b>.</span>
ru: <span font_desc='Sans 16'> <b><u><i>%(date)s</i></u></b>.</span>

source: <b>Words Per Minute:</b> %(wpm)d
de: <b>Wörter pro Minute:</b> %(wpm)d
ru: <b>Слов в минуту:</b> %(wpm)d

source: <b>SCORE:</b> %(score)d
de: <b>PUNKTZAHL:</b> %(score)d
ru: <b>СЧЁТ:</b> %(score)d
